import type { MockMethod } from 'vite-plugin-mock'

const mockItems: MockMethod[] = [
  {
    url: '/mock/music',
    method: 'get',
    response: () => {
      return {
        headers: {
          'Content-Type': 'application/json'
        },
        status: 200,
        data: `[00:00.000]夜曲 - 周杰伦 (Jay Chou)
[00:04.990]词：方文山
[00:09.980]曲：周杰伦
[00:14.970]编曲：林迈可
[00:19.970]制作人：周杰伦
[00:24.960]一群嗜血的蚂蚁 被腐肉所吸引
[00:27.960]我面无表情 看孤独的风景
[00:30.980]失去你 爱恨开始分明
[00:33.470]失去你 还有什么事好关心
[00:36.430]当鸽子不再象征和平
[00:38.310]我终于被提醒
[00:39.680]广场上喂食的是秃鹰
[00:41.990]我用漂亮的押韵
[00:43.170]形容被掠夺一空的爱情
[00:45.500]
[00:46.950]啊 乌云开始遮蔽 夜色不干净
[00:49.640]公园里 葬礼的回音 在漫天飞行
[00:52.400]送你的白色玫瑰
[00:54.010]在纯黑的环境凋零
[00:55.550]乌鸦在树枝上诡异的很安静
[00:57.890]静静听 我黑色的大衣
[01:00.340]想温暖你日渐冰冷的回忆
[01:02.390]走过的走过的生命
[01:03.970]啊 四周弥漫雾气
[01:05.180]啊 我在空旷的墓地
[01:06.570]老去后还爱你
[01:08.040]
[01:08.980]为你弹奏肖邦的夜曲
[01:12.080]纪念我死去的爱情
[01:14.370]
[01:14.890]跟夜风一样的声音
[01:17.560]心碎的很好听
[01:20.380]手在键盘敲很轻
[01:23.120]我给的思念很小心
[01:25.890]你埋葬的地方叫幽冥
[01:29.590]
[01:30.100]为你弹奏肖邦的夜曲
[01:34.160]纪念我死去的爱情
[01:36.970]而我为你隐姓埋名
[01:39.660]在月光下弹琴
[01:42.480]对你心跳的感应
[01:45.200]还是如此温热亲近
[01:47.920]怀念你那鲜红的唇印
[01:52.050]
[02:15.190]那些断翅的蜻蜓 散落在这森林
[02:18.340]而我的眼睛 没有丝毫同情
[02:21.420]失去你 泪水混浊不清
[02:23.810]失去你 我连笑容都有阴影
[02:26.900]风在长满青苔的屋顶
[02:28.670]嘲笑我的伤心
[02:30.060]像一口没有水的枯井
[02:32.300]我用凄美的字型
[02:33.370]描绘后悔莫及的那爱情
[02:36.220]
[02:37.280]为你弹奏肖邦的夜曲
[02:40.330]纪念我死去的爱情
[02:43.100]跟夜风一样的声音
[02:45.820]心碎的很好听
[02:48.740]手在键盘敲很轻
[02:51.360]我给的思念很小心
[02:54.150]你埋葬的地方叫幽冥
[02:57.660]
[02:58.500]为你弹奏肖邦的夜曲
[03:02.390]纪念我死去的爱情
[03:05.210]而我为你隐姓埋名
[03:07.920]在月光下弹琴
[03:10.760]对你心跳的感应
[03:13.420]还是如此温热亲近
[03:16.240]怀念你那鲜红的唇印
[03:20.370]
[03:21.370]一群嗜血的蚂蚁 被腐肉所吸引
[03:24.490]我面无表情 看孤独的风景
[03:27.520]失去你 爱恨开始分明
[03:29.990]失去你 还有什么事好关心
[03:32.980]当鸽子不再象征和平
[03:34.810]我终于被提醒
[03:36.240]广场上喂食的是秃鹰
[03:38.470]我用漂亮的押韵
[03:39.680]形容被掠夺一空的爱情`,
        message: 'success',
      }
    },
  },
]

export default mockItems
